{"basics":{"name":"Chunde Huang","label":"Software Engineer & physicist","image":"","email":"xmuhcd@msn.com","phone":"(509) 339-4260","url":"https://www.mpi.ai/","summary":"I am a seasoned software engineer with over ten years of experience in software development (C++/C#/Python). In 2013, I transitioned from industry to academia to pursue a Ph.D. in physics, expanding my expertise to include quantum computing, cold atom experiment, and the quantum simulation of superfluidity. My diverse background in computer science and physics positions me to excel in interdisciplinary research. I am eager to leverage my extensive knowledge to tackle exciting and challenging projects that will change the future well beings of humankind, such as quantum computing, artificial intelligence, robotics and biological engineering etc.","location":{"address":"2712 Broadway St","postalCode":"CA 94115","city":"San Francisco","countryCode":"US","region":"California"},"profiles":[{"network":"LinkedIn","username":"Chunde","url":"https://www.linkedin.com/in/chunde/"}]},"work":[{"name":"KLA-Tencor","position":"Senior Software Engineer","url":"https://www.kla.com/","startDate":"2021-07-15","endDate":"present","summary":"Teaching at Palmer Physical Laboratory (now 302 Frist Campus Center). While not a professor at Princeton, I associated with the physics professors and continued to give lectures on campus.Senior C++ Software Engineer at KLA, focused on designing and developing complex system control software for advanced machines valued in the tens to hundreds of millions. This role demands expertise across multiple disciplines, including computer science, electrical and mechanical engineering, optics, laser technology, and vacuum systems.","highlights":["EUV Source"]},{"name":"CGG","position":"Imaging Analyst","url":"https://www.cgg.com/","startDate":"2020-06-15","endDate":"2021-06-15","summary":"Spent one year at CGG, focusing on imaging analysis and extensive data preprocessing. Responsibilities included data denoising, domain migration, and modeling to generate detailed subsurface structures, supporting clients in subsurface exploration and risk reduction.","highlights":["Wave Functions"]}],"education":[{"institution":"Washington State University","location":"Pullman, WA, USA","url":"https://www.wsu.edu/","area":"Physics","studyType":"PhD","startDate":"2013-08-15","endDate":"2020-05-20","score":"10","courses":["Theory of Relativity","Quantum Physics"]},{"institution":"Xiamen University, ","location":"Xiamen,China","url":"https://www.xmu.edu.cn/","area":"Computer Science","studyType":"M.S","startDate":"2007-09-01","endDate":"2010-07-01","score":"10","courses":["Computer Vision"]},{"institution":"Xiamen University, ","location":"Xiamen,China","url":"https://www.xmu.edu.cn/","area":"Software Engineering","studyType":"B.S","startDate":"2003-09-01","endDate":"2007-07-01","score":"10","courses":["Data Structure","C language","Algorithm","Hardware Archtectruire","Software Architecture","Network","Data Base","Operating System","Compiler Principle","UML"]}],"awards":[{"title":"Second Prize in the National Academic Contest of Challenge Cup for 2010 Shanghai World Exposition","date":"2009-10-01","awarder":"Ministry of Education of the People's Republic of China","summary":"I developed a prize-winning facial recognition system in Beijing, built primarily in C++ and C# with optimized Intel assembly code to enhance graphic processing and boost algorithmic performance. The system features a sleek, user-friendly interface and achieves real-time processing capabilities."}],"publications":[{"name":"Binarized Gerchberg Saxton Algorithm for Hologram Generation Using a Digital Micromirror Device","publisher":"arXiv","releaseDate":"2020-05-20","url":"https://arxiv.org/abs/1910.00658","summary":"A laser can induce atom-light interactions through dipole interactions. In cold atom physics, lasers are widely used to manipulate atoms in various ways, including Rabi flopping, dipole trapping, optical lattices, potential barriers, and phase masks. A key area of interest is the construction of quantum gas microscopes [1] for single-site addressability, providing an efficient method to control the quantum state of individual cold atoms. When multiple sites form a lattice, the trapped atoms become useful for quantum computing applications. Achieving this requires exceptionally precise lattice generation, which is challenging due to optical aberrations in the setup. To correct for wavefront distortions, one effective approach is to use binary holograms to compensate for these imperfections."},{"name":"A Fast HOG Descriptor Using Lookup Table and Integral Image","publisher":"arXiv","releaseDate":"2018-08-13","url":"http://arxiv.org/abs/1703.06256","summary":"The histogram of oriented gradients (HOG) is a widely used feature descriptor in computer vision for the purpose of object detection. In the paper, a modified HOG descriptor is described, it uses a lookup table and the method of integral image to speed up the detection performance by a factor of 5~10. By exploiting the special hardware features of a given platform(e.g. a digital signal processor), further improvement can be made to the HOG descriptor in order to have real-time object detection and tracking."},{"name":"Face recognition by Zero-Ratio based LGBP features","publisher":"Proceeding of the 11th World Congress on Intelligent Control and Automation","releaseDate":"2015-03-05","url":"https://ieeexplore.ieee.org/document/7053674","summary":"LGBP has been successfully applied in face recognition, which combines Gabor decomposition and LBP descriptor. However, in this method LBP histograms from multi-scale and multi-orientation Gabor energy images are concatenated to form the feature vector for input image, so the dimension of generated features is very high. In this paper we propose a novel face recognition method called Zero-Ratio based LGBP, which uses a feature selection method called Zero-Ratio to reduce the dimension of LGBP features effectively. We evaluate our method on AR face database, the experimental results show that our method can greatly reduce dimension of LGBP features without significantly affecting recognition accuracy."},{"name":"A Fast Eye Localization Algorithm Using Integral Image","publisher":"2009 Second International Symposium on Computational Intelligence and Design","releaseDate":"2009-12-31","url":"https://ieeexplore.ieee.org/document/5369247","summary":"Eye localization is an essential step in automatic face recognition system(AFRC), since it has a direct influence on the overall recognition performance. In this paper, we present a simple and fast eye localization algorithm, called integral image approach (IIA), for real time face recognition system. IIA can find out candidate positions for pupils and brows using the representation of image. Then by applying some constraints, such as the position of left pupil should be lower than that of the left brow, and adjusting the results, the IIA can eventually retrieve the locations of two pupils in a given face. The experiments show that the proposed IIA can locate eyes considerably fast with high accuracy in nearly frontal faces."}],"skills":[{"name":"Physics","level":"Ph.D","icon":"fa-solid fa-hashtag","keywords":["Cold Atom Experiements","Theoreticl Quantum Simulation","Laser","Optics","Spectroscopy","Circuitry"]},{"name":"Computer Science","level":"M.S","icon":"fa-solid fa-hashtag","keywords":["Computer Graphics","Computer Vision","Machine Learning","Reinforcement Learning","Signal Analysis","Python","C++","C#","Matlab"]}],"languages":[{"language":"Chinese","fluency":"Native speaker","icon":""},{"language":"English","fluency":"Fluent","icon":""}],"interests":[{"name":"Physics","icon":"fa-solid fa-tag","keywords":[]}]}